/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bopopovi <bopopovi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/05/29 16:05:25 by bopopovi          #+#    #+#             */
/*   Updated: 2018/06/05 14:48:11 by bopopovi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"
#include <wchar.h>
#include <stdio.h>
#include <unistd.h>

void	printf_tests();
void	ptf_wc(wchar_t c);
void				stock_value(int value);

int		main()
{
	/*char	*stest = "Hello";
	int		dtest = 1234;
	char	ctest = 'X';*/

	//ft_printf("1st spec : %d and 2nd spec : %d");
	//ft_printf("1st spec : %d and 2nd spec : %d", 10, 9);
	//printf(L"%C", wc); // Gives interesting compilation error
	wchar_t wc = L'Ʃ';
	unsigned int tmp = (unsigned int)wc;

	(void)tmp;

	wchar_t *str = L"事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女事人迫年売麿天車万当憲室全暮主味能区文。社宇都強却理語益元狙養回健広者求。棋高酔中投索年雪紺価施岡順走責屋楽供商。段香高野投実四圭抽熱士理受予選上。期試声転展上委舞馬名問鼓酸松著。制毎行面供害現停生度注球大田死歳野良御現。能質性経容止国向和無浸得。濯沖好本好暮取像盤世付点東。左戦彰一定代断作治若合月服調文島史比前欲。寄陸井築米応際頑月田民骨年書被南際条。教人介判次座例住苦掲鑑浜送腰。政発尚清上三権改一先戦則決。性囲国逃保政防中相問康本本多練繰。写流島刻口欺禁願首能応季画提。試要変三固房講歯員須立連標署詰。堀投文角奇辞変認段早発輪役循。使柄額示終意参探毎洲説間午結京午営率著海。国治産級世要前映済日益故並発爽好。能可換総込隊級提会循女速。表題接援福面変選命訪進座著市俊。投比中弘氏善便略条訪負表楽北際芸込紀正。麗力担実商欠著転未校独変。禁報園直湾従履七第資濡織新手案堅揮。事主広指絞丈午者能南飛役石発順質刊。縄決待譲路井浩政観論可町図四暮供青暑似意。齢誘治注存賞筒響書犬働済版。止営与木橋衝待向学作旅巡歴連気出和。王昨代診記資格鳥者遺線優各。美仕事任写是質山開変勇済聞営提馬季交必。高覚審問極金作王合局未級分題。座話田覧軍果日後歌婦民滋参。刊世後何和院博格方改録情指割名将。沖太減生社試埼聴縮島育抗。行写国木率正真都仕新学正写元理強毛情。読応業故市瀬沼川勢控間岡料重録業廃転録的。属芸漫経円京属航育立東症料州。総事常択探人者際点従運女長。歩党猿理展目緻小課物康面転。教司雪応指育接死義中佐知質攻込入投会転界。刻膨薙程連業連覧文初正昔今金販院訪提経無。会旅対提大量的証試供惑次期空。凸問俊金米支済変複世創協。著態治懲知喫形国伝能予田必軽券。棋勢次委年業諸最常環他食止帰大決情四。第方長烹関含点報負同先式観供牛考政成。富芸年払砂建闘日住権球管府崎委日。育能観佐徹禁米病方課委広転分西。意互天井資呼権図聞異格担使換投従書絶論。援県発熱校訳社園写津松禁。展写広要上積止組選載喚闘。信認左元負出氷表美等促通感長作消声面路動。見際残三変配限内員件済大上際展連場。文声回懲団計掲著県深断気。昨目録獄去需覚速運化市携公王事弁県金大速。米打化約会尼得旅際鳴部禁紙蒼。家浸展各寸金町感咲情応新紀市長写全。上代供選協威売象開際飼豚納住女。状同止長部申合宣権通号圏鉄。身第記重東更会士体気竹鉄。均美選士信女";

	int i = 0;
	while (str[i])
	{
		ptf_wc(str[i]);
		i++;
	}

	/*while (str[i])
	{
		stock_value(str[i]);
		i++;
	}*/

	(void)str;
	(void)i;
	//printf_tests();

	return (0);
}

int		ft_pow(int nbr, int pow)
{
	while (pow--)
	{
		nbr *= nbr;
	}
	return (nbr);
}

void	ptf_wc(wchar_t c)
{
	unsigned char			bytes[5];
	int	shift;
	int i;

	/*ft_putnbr_base(c, "01");
	ft_putchar('\n');*/

	ft_bzero(bytes, 5);
	shift = 24;
	i = 0;
	bytes[0] = c <= 127 ? c : 0;
	c = c <= 127 ? 0 : c;
	bytes[0] += c > 127 ? 64 : 0;
	bytes[0] += c > 4096 ? 32 : 0;
	bytes[0] += c > 262144 ? 16 : 0;
	while (shift > 0)
	{
		shift -= 6;
		if ((c >> shift) != 0 || i != 0)
		{
			bytes[i] += (c >> shift) + 128;
			c ^= (c >> shift) << shift;
			i++;
		}
	}
	//write(1, &bytes, i == 0 ? 1 : i);
	write(1, &bytes, 5);
	/*ft_putchar('\n');
	ft_putnbr_base(bytes[0], "01");
	ft_putchar('\n');
	ft_putnbr_base(bytes[1], "01");
	ft_putchar('\n');
	ft_putnbr_base(bytes[2], "01");
	ft_putchar('\n');
	ft_putnbr_base(bytes[3], "01");
	ft_putchar('\n');*/
}

void				stock_value(int value)
{
	unsigned char bytes[5];
	ft_bzero(bytes, 5);
	if (value > 0xFFFF)
	{
		bytes[0] = ((0b11110000 | (value >> 18)) & ~0b00001000);
		bytes[1] = ((0b10000000 | (value >> 12)) & ~0b01000000);
		bytes[2] = ((0b10000000 | (value >> 6)) & ~0b01000000);
		bytes[3] = ((0b10000000 | (value >> 0)) & ~0b01000000);
	}
	else if (value > 0x7FF)
	{
		bytes[0] = ((0b11100000 | (value >> 12)) & ~0b00010000);
		bytes[1] = ((0b10000000 | (value >> 6)) & ~0b01000000);
		bytes[2] = ((0b10000000 | (value >> 0)) & ~0b01000000);
	}
	else if ((value > 0x7F) || value > 255)
	{
		bytes[0] = ((0b11000000 | (value >> 6)) & ~0b00100000);
		bytes[1] = ((0b10000000 | (value >> 0)) & ~0b01000000);
	}
	else
	{
		bytes[0] = value;
	}
	write(1, bytes, 5);
}

void	printf_tests()
{
	char *stest = "Hello";
	char *stest2 = "wassup ?";
	int		dtest = 1234;
	char	ctest = 'X';

	//printf("%2$s %3$s", stest, stest2);

	(void)stest;
	(void)stest2;
	(void)dtest;
	(void)ctest;


}
